Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Adds two decimal numbers.
ja: ２つの10進数を加算します。

source: Adds two decimal values.
ja: ２つの10進数値を足し算します。

source: Adjusts the sides of a rectangle to integer values.
ja: 矩形の辺を整数値に合わせて調整する。

source: Adjusts the sides of a rectangle to integral values using the specified options.
ja: 矩形の辺を整数値に調整します、指定されたオプションを使います。

source: Adopted By
ja: 採用先

source: Adopting Codable on your own types enables you to serialize them to and from any of the built-in data formats, and any formats provided by custom encoders and decoders.
ja: Codableをいろいろなあなた独自の型で採用することは、あなたにそれらをあらゆる組込みデータ形式、そしてあつらえのエンコーダとデコーダによって提供されるあらゆる形式へとおよびそれからシリアライズすることを可能にします。

source: Adopting these protocols lets implementations of the Encoder and Decoder protocols take your data and encode or decode it to and from an external representation such as JSON or property list.
ja: これらのプロトコルの採用は、EncoderとDecoderプロトコルの実装に、あなたのデータを取らせて、それをJSONやプロパティリストのような外部表現へとそしてそれからエンコードおよびデコードさせます。

source: Advertise services for easy discovery on local networks, or discover services advertised by others.
ja: ローカルネットワーク上での簡単な発見のためにサービスを宣伝します、または他のものによって宣伝されるサービスを発見します。

source: After an immutable array has been initialized in this way, it cannot be modified.
ja: 不変の配列がこの方法で初期化され終わった後は、それは修正されることはできません。

source: After an immutable array has been initialized in this way, it can’t be modified.
ja: 不変の配列がこの方法で初期化され終わった後、それは修正されることができません。

source: After calling this method, you may still use the file handle object but must not attempt to read or write data or use the object to operate on the file descriptor.
ja: このメソッドを呼び出した後、あなたはまだファイルハンドルオブジェクトを使うかもしれません、しかしデータの読み込みや書き出しまたはそのオブジェクトを使ってファイル記述子上で演算を試みてはいけません。

source: After calling this method, you must wait for a file to be fully uploaded to iCloud before attempting to share the file using the url(for Publishing Ubiquitous Item At: expiration:) method.
ja: このメソッドを呼び出した後、url(for Publishing Ubiquitous Item At: expiration:)メソッドを使ってファイルを共有する前に、あなたはファイルが完全にiCloudへアップロードされるのを待たなければなりません。

source: After initialization, the file wrapper is not associated with a file-system node until you save it using write(to: options: original Contents URL:).
ja: 初期化後、ファイルラッパーは、ファイルシステムノードと結び付けられません、あなたがそれをwrite(to: options: original Contents URL:)を使って保存しない限りは。

source: After invoking this method, applying the receiver’s matrix modifies the unit length on the x axis by a factor of scale X and the y axis by a factor of scale Y, in addition to performing all previous transformations.
ja: このメソッドを発動後、レシーバの行列を適用することは、全ての以前の変換を実行することに加えて、レシーバの行列をx軸をscale Xの因数そしてy軸をscale Yの因数でその単位の長さ変更します。

source: After invoking this method, applying the receiver’s matrix modifies the unit lengths along the current x and y axes by a factor of scale, in addition to performing all previous transformations.
ja: このメソッドを発動後、レシーバの行列を適用することは、全ての以前の変換を実行することに加えて、レシーバの行列をscaleの因数よって現在のxとy軸に沿ってその単位の長さ変更します。

source: After invoking this method, applying the receiver’s matrix turns the axes counterclockwise about the current origin by angle degrees, in addition to performing all previous transformations.
ja: このメソッドを発動後、レシーバの行列を適用することは、全ての以前の変換を実行することに加えて、軸を現在の原点についてangle度で反時計回りに回転させます。

source: After invoking this method, applying the receiver’s matrix turns the axes counterclockwise about the current origin by angle radians, in addition to performing all previous transformations.
ja: このメソッドを発動後、レシーバの行列を適用することは、全ての以前の変換を実行することに加えて、軸を現在の原点についてangleラジアンで反時計回りに回転させます。

source: After it writes the data, the method advances the file pointer by the number of bytes written.
ja: それがデータを書き出す後、メソッドはファイルポインタを書き出されたバイト数だけ前進させます。

source: After locating (or creating) the desired directory, this method returns the URL for that directory.
ja: 望むディレクトリの位置を突き止めた後、このメソッドはそのディレクトリに対するURLを返します。

source: After locating the resource, the bundle routines return a path string or URL that you can use to open the file.
ja: リソースを捜し出した後、バンドルルーチンは、あなたがそのファイルを開くのに使うことができるパス文字列またはURLを返します。

source: After partitioning a collection, there is a pivot index p where no element before p satisfies the belongs In Second Partition predicate and every element at or after p satisfies belongs In Second Partition.
ja: コレクションを仕切った後、あるピボットインデックスpがあります、そこでpの前の要素は１つもbelongs In Second Partition述部を満たさず、そしてpでのまたは後のあらゆる要素はbelongs In Second Partitionを満たします。

source: After placing this property-list file in your application bundle, you can use this method to extract context help information from it.
ja: このプロパティリストファイルをあなたのアプリケーションバンドルの中に置いた後、あなたはこのメソッドを使ってコンテキストヘルプ情報をそれから抽出します。

source: After the method returns, message your main thread to update the rest of your app’s data structures.
ja: メソッドが返った後、あなたのメインスレッドに知らせて、あなたのアプリの持つデータ構造の残りを更新してください。

source: After the rotation and scaling factors are applied, this method effectively returns the end point of the new vector.
ja: 回転と拡大縮小因数が適用された後、このメソッドは効果的に新しいベクターの終端点を返します。

source: After the user unlocks the device for the first time, your app can access the file and continue to access it even if the user subsequently locks the device.
ja: ユーザがデバイスを最初にアンロックした後、あなたのアプリはファイルにアクセスできます、そしてたとえユーザがその後にデバイスをロックしてさえ、それへのアクセスを継続できます。

source: After using index(of:) to find the position of a particular element in a collection, you can use it to access the element by subscripting.
ja: index(of:)を使って特定の要素の位置をあるコレクションの中で見つけた後、あなたは添え字によって要素にアクセスするのにそれを使うことができます。

source: Aligns all edges inward.
ja: 全ての縁を内側に向かって整列します。

source: Aligns all edges outwards.
ja: 全ての縁を外側に向かって整列します。

source: Aligns all edges to the nearest value.
ja: 全ての縁を最も近い値に整列します。

source: All +load methods in your image.
ja: あなたのイメージの中の全ての+loadメソッド。

source: All Apple events that are part of a transaction must have the same transaction ID.
ja: あるトランザクションの一部である全てのアップルイベントは、同じトランザクションIDを持たなければなりません。

source: All C++ static initializers and C/C++ __attribute__(constructor) functions in your image.
ja: あなたのイメージの中の全ての静的イニシャライザとC／C++ __attribute__(constructor)関数。

source: All HTTP header fields of the receiver.
ja: レシーバの全てのHTTPヘッダフィールド。

source: All attempts at writing/logging a message complete before the next thread can begin its attempts.
ja: あるメッセージの「書き出し／ログ実行」でのすべての試みは、次のスレッドがそれの試みを始める前に完了します。

source: All components, calculated using the Calendar and Time Zone.
ja: すべての構成要素、CalendarとTime Zoneを使って計算されます。

source: All date and time values are localized and formatted according to the current user’s language preferences.
ja: 全ての日付と時刻値は、現在のユーザの言語環境設定によってローカライズおよび書式設定されます。

source: All directories where applications can occur.
ja: アプリケーションが存在することが可能な全てのディレクトリ。

source: All directories where resources can occur.
ja: リソースが存在することが可能な全てのディレクトリ．

source: All domains.
ja: 全ての領域。

source: All elements satisfying this predicate are ordered after all elements not satisfying it.
ja: この述部を満たす全ての要素は、それを満たさない全ての要素の後に並べられます。

source: All initializers in any framework you link to.
ja: あなたがそれへとリンクする何らかのフレームワークの中の全てのイニシャライザ。

source: All initializers in frameworks that link to you.
ja: あなたへとリンクするフレームワークの中の全てのイニシャライザ。

source: All other date components are ignored.
ja: 全ての他の日付構成要素は、無視されます。

source: All perform requests having the same target a Target are canceled.
ja: 同じ目標（ターゲット）a Targetを持つ全ての実行要請がキャンセルされます。

source: All relative pathnames refer implicitly to the current working directory.
ja: 全ての相対パス名は、暗黙的に現在の作業ディレクトリを参照します。

source: All subclasses must fully implement the base Unit() method designating the base unit, relative to which any additional units are defined.
ja: 全てのサブクラスは、それに相対してあらゆる追加単位が定義される、基本単位を指名しているbase Unit()メソッドを完全に実装しなければなりません。

source: All the NSDecimal... arithmetic functions expect compact Decimal arguments.
ja: 全てのNSDecimal...算術関数は、コンパクトなDecimal引数を期待します。

source: All the elements following the specified position are moved to close the gap.
ja: 指定された位置に続く要素すべては、隙間を埋めるように移動されます。

source: All the hostnames of the receiver.
ja: レシーバのホスト名の全て。

source: All the information in an Apple event is stored in descriptors and lists of descriptors, and every Apple event is itself a descriptor list that matches certain criteria.
ja: あるアップルイベントの中の全ての情報はいくらかの記述子の中に格納されます、つまりあらゆるアップルイベントはそれ自身が、ある規範に合致する１つの記述子リストです。

source: All the network addresses of the receiver.
ja: レシーバのネットワークアドレスの全て。

source: All these examples use the regular expression \\b(a|b)(c|d)\\b as their regular expression.
ja: これらの例の全ては、それらの正規表現として正規表現\\b(a|b)(c|d)\\bを使います。

source: All types of return values can be delivered to the sender: id types, structures, double-precision floating-point numbers.
ja: 全ての型の戻り値が、送り手に届けらることができます：id型、構造体、倍精度浮動小数点数。

source: Allocates a new block of memory.
ja: 新しいメモリのブロックをアロケートします。

source: Allocates a new instance of the receiving class, sends it an init message, and returns the initialized object.
ja: 受け取っているクラスの新しいインスタンスをメモリ割り当てして、それにinitメッセージを送ります、そしてその初期化されたオブジェクトを返します。

source: Allocates collectable memory.
ja: 収容可能なメモリをアロケートします。

source: Allocates the integral number of pages whose total size is closest to, but not less than, byte Count.
ja: 整数のページ数をアロケートします、それの全体のサイズはbyte Countに最も近い、しかしそれより小さくありません。

source: Allow . to match any character, including line separators.
ja: .に行セパレーターを含むどんな文字でもマッチすることを認めます。

source: Allow ^ and $ to match the start and end of lines.
ja: ^と$が行の始まりと終わりにマッチするのを許します。

source: Allow users to control your app with AppleScript and other automation technologies, or run scripts from within your app.
ja: ユーザにあなたのアプリをAppleScriptや他の自動化技術での制御を、またはあなたのアプリの内部からのスクリプト実行を可能にします。

source: Also, data elements must remain invariant if the value of the hashing function depends on them; for example, if the hashing function operates directly on the characters of a string, that string can’t change.
ja: また、もしハッシュ関数の値がそれらに依存するならば、データ要素は変化しないままでなければなりません；例えば、ハッシュ関数が直接に文字列の文字上で作用するならば、その文字列は変化できません。

source: Also, if the final path component in path is a symbolic link, that link is not followed.
ja: また、pathでの最後のパス構成要素がシンボリックリンクならば、そのリンクはたどられません。

source: Also, if the final path component in url is a symbolic link, that link is not followed.
ja: また、urlでの最後のパス構成要素がシンボリックリンクならば、そのリンクはたどられません。

source: Alternation.
ja: 代替。

source: Alternatively, a predicate can be satisfied by a range of Equatable elements or a general condition.
ja: あるいは、述部は、Equatable要素のある範囲またはある一般的条件によって満たされることができます。

source: Alternatively, if a custom unit is used extensively throughout an app, consider extending the corresponding NSDimension subclass and adding a class method.
ja: または、あつらえの単位が広範囲にあるアプリの至る所で使われるならば、対応するNSDimensionサブクラスを拡張して、クラスメソッドを追加することを考慮してください。

source: Alternatively, use this method to sort a collection of elements that do conform to Comparable when you want the sort to be descending instead of ascending.
ja: そうではなくて、あなたが昇順ではなく降順でソートしたい場合は、このメソッドを使ってComparableに準拠する要素からなるコレクションをソートしてください。

source: Alternatively, you can use array literal syntax in Objective-C or Swift to create an array containing a given object:
ja: あるいはまた、あなたは配列リテラル構文をObjective-CまたはSwiftにおいて使用して、与えられたオブジェクトを含んでいる配列を作成できます：

source: Alternatively, you could use composition to achieve the desired behavior.
ja: あるいは、あなたは望む挙動を達成するためにコンポジション（合成）を使うことができます。

source: Alternatives to Subclassing
ja: サブクラス作成の代わりとなるもの

source: Although .express is not a member of options, .express subsumes the remaining .second Day element of the option set.
ja: とは言え.expressはoptionsのメンバではありません、しかし.expressはこのオプションセットの残りの要素.second Dayを包含します。

source: Although NSInput Stream is probably sufficient for most situations requiring access to stream data, you can create a subclass of NSInput Stream if you want more specialized behavior (for example, you want to record statistics on the data in a stream).
ja: NSInput Streamがストリームデータへのアクセスを要求するほとんどの状況におそらく十分であるとはいえ、あなたはNSInput Streamのサブクラスを作成することが、あなたがより特殊化された挙動を望むならば可能です（例えば、あなたがストリームでのデータ上で統計情報を記録したい）。

source: Although the read, accept, and wait operations themselves are performed asynchronously on background threads, the file handle uses a run loop source to monitor the operations and notify your code appropriately.
ja: 読み込み、受け取り、そして待ち受けの演算処理それら自体はバックグラウンドスレッド上で非同期に実行されるけれども、ファイルハンドルは実行ループソースを使うことで演算処理を監視して適切にあなたのコードに通知します。

source: Although the subclasses listed in Table 1 are suitable for most purposes, you may want to define a custom unit type.
ja: Table 1で一覧にされるサブクラスがほとんどの目的に適するとはいえ、あなたはあつらえの単位型を定義したいかもしれません。

source: Always make sure that you specify filenames with case sensitivity in mind.
ja: 常にあなたが大文字小文字を考慮するファイル名を指定することを心に留めておいてください。

source: Always set to the date Style and time Style properties to appropriate values before generating any strings.
ja: 常にdate Styleとtime Styleプロパティを適切な値に設定してください、何らかの文字列を生成する前にです。

source: Always use the URL returned by this method to locate the group directory rather than manually constructing a URL with an explicit path.
ja: 常にこのメソッドによって返されるURLを使ってグループディレクトリの位置を突き止めてください、手動でURLをある明示的なパスで組み立てるのではなく。

source: Always use the slice’s start Index property instead of assuming that its indices start at a particular value.
ja: 常にスライスのstart Indexプロパティを使ってください、それのインデックスが特定の値で始まると決めてかかるのではなく。

source: An 8-bit representation of Unicode characters, suitable for transmission or storage by ASCII-based systems.
ja: ユニコード文字の８ビット表現、ASCII基盤システムによる伝達または格納に適します。

source: An NSText Checking Result object.
ja: NSText Checking Resultオブジェクト。

source: An NSText Checking Result specifying the match.
ja: マッチを特定しているNSText Checking Result。

source: An Cached URLResponse object provides the server’s response metadata in the form of an URLResponse object, along with an NSData object containing the actual cached content data.
ja: Cached URLResponseオブジェクトは、サーバーの持つ応答メタデータをURLResponseオブジェクトの形式で、加えて実際のキャッシュされたコンテンツデータを含んでいるNSDataオブジェクトも提供します。

source: An Date Components Formatter object takes quantities of time and formats them as a user-readable string.
ja: Date Components Formatterオブジェクトは、いくつかの時間量をとって、それらをユーザの読める文字列として書式設定します。

source: An Date Interval Formatter object creates user-readable strings from pairs of dates.
ja: Date Interval Formatterオブジェクトは、ユーザが読むことができる文字列を一組の日付から作成します。

source: An File Manager object lets you examine the contents of the file system and make changes to it.
ja: File Managerオブジェクトは、あなたにファイルシステムの内容を調査させ、それを変更させます。

source: An Host object contains all of the network addresses and names discovered for a given host by the network administration services.
ja: Hostオブジェクトは、ネットワーク管理サービスによって、指定ホストに対して発見されたネットワークのアドレスおよび名前の全てを含みます。

source: An NSAttributed String object manages character strings and associated sets of attributes (for example, font and kerning) that apply to individual characters or ranges of characters in the string.
ja: NSAttributed Stringオブジェクトは、文字列および、文字列中の個々の文字もしくは文字範囲に適用される関連属性一式（例えば、フォントとカーニング（文字詰め））を管理します。

source: An NSBundle object initialized to correspond to full Path.
ja: full Pathに一致するように初期化されるNSBundleオブジェクト。

source: An NSBundle object initialized to correspond to url.
ja: urlに一致するように初期化されるNSBundleオブジェクト。

source: An NSCharacter Set object represents a set of Unicode-compliant characters.
ja: あるNSCharacter Setオブジェクトは、あるユニコード対応文字集合を表します。

source: An NSData object containing the available data read from a socket connection
ja: 利用可能なデータを含むNSDataオブジェクトは、ソケット接続から読み込みます。

source: An NSData object with the contents of the file.
ja: ファイルの内容を持つNSDataオブジェクト。

source: An NSDate object or NSString object specifying the expiration date for the cookie.
ja: NSDateオブジェクトまたはNSStringオブジェクト、クッキーの有効期限を指定しています。

source: An NSDate Interval object represents a closed interval between two dates.
ja: NSDate Intervalオブジェクトは、２つの日付の間の閉区間を表します。

source: An NSDictionary object that describes the POSIX attributes of the file specified at path.
ja: NSDictionaryオブジェクト、それはpathで指定されたファイルのPOSIX属性を記述します。

source: An NSDictionary object that describes the attributes of the mounted file system on which path resides.
ja: あるNSDictionaryオブジェクト、それはそれにpathが居住するところのマウント済みファイルシステムの属性を記述します。

source: An NSDimension subclass object from which all other units provided by the subclass are defined.
ja: サブクラスによって提供される全ての他の単位が定義される、NSDimensionサブクラスオブジェクト。

source: An NSDirectory Enumerator object enumerates the contents of a directory, returning the pathnames of all files and directories contained within that directory.
ja: NSDirectory Enumeratorオブジェクトは、あるディレクトリの内容を列挙します、そのディレクトリ内に含まれるすべてのファイルとディレクトリのパス名を返します。

source: An NSDirectory Enumerator object that enumerates the contents of the directory at path.
ja: NSDirectory Enumeratorオブジェクト、それはpathでのディレクトリの内容を列挙します。

source: An NSFile Manager object sends this message to a handler immediately before attempting to move, copy, rename, or delete, or before attempting to link to a given path.
ja: 移動、コピー、名前変更、または消去を試みる直前に、または与えられたパスにリンクを試みる前にハンドラにこのメッセージを送ったNSFile Managerオブジェクト。

source: An NSFile Manager object sends this message to its handler for each error it encounters when copying, moving, removing, or linking files or directories.
ja: ファイルまたはディレクトリをコピー、移動、削除、またはリンクする場合にそれが出くわす各エラーに対するそれのハンドラにこのメッセージを送ったNSFile Managerオブジェクト。

source: An NSLocale object.
ja: あるNSLocaleオブジェクト。

source: An NSMap Enumerator structure that will cause successive key-value pairs of table to be visited each time this enumerator is passed to NSNext Map Enumerator Pair.
ja: あるNSMap Enumerator構造体で、それはtableの連続するキー値ペアに、この列挙子がNSNext Map Enumerator Pairに渡されるたびごとに訪問されるようにします。

source: An NSNumber object containing an integer representing the UNIX-type error which occurred
ja: 発生したUNIX型エラーを表している整数を含んでいるNSNumberオブジェクト

source: An NSNumber that specifies the error number.
ja: エラー番号を指定するNSNumber。

source: An NSPerson Name Components object encapsulates the components of a person's name in an extendable, object-oriented manner.
ja: NSPerson Name Componentsオブジェクトは、ある個人の名前の構成要素を、ある拡張可能な、オブジェクト指向の流儀でカプセル化します。

source: An NSPoint having the coordinates x and y.
ja: あるNSPoint、座標xとyを持っています。

source: An NSPoint typecast from a CGPoint.
ja: CGPointから型キャストされたNSPoint。

source: An NSRange with location location and length length.
ja: あるNSRange、位置locationと長さlengthを持ちます。

source: An NSRange Specifier object specifies a range (that is, an uninterrupted series) of objects in a container through two delimiting objects.
ja: NSRange Specifierオブジェクトは、オブジェクトの範囲（すなわち、途切れのない連続）をあるコンテナにおいて２つの境界を指定するオブジェクトを通して指定します。

source: An NSRect having the specified origin of [x, y] and size of [w, h].
ja: あるNSRect、 [x, y] の原点と [w, h] のサイズを持っています。

source: An NSRect typecast from a CGRect.
ja: CGRectから型キャストされたNSRect。

source: An NSScript Execution Context object is a shared instance (there is only one instance of the class) that represents the context in which the current script command is executed.
ja: NSScript Execution Contextオブジェクトは、ある共有インスタンスです（このクラスのインスタンスは１つしかありません）、それはそこにおいて現在のスクリプトコマンドが実行される前後関係を表します。。

source: An NSSize having the specified width and height.
ja: あるNSSize、指定されたwidthとheightを持っています。

source: An NSSize typecast from a CGSize.
ja: CGSizeから型キャストされたNSSize。

source: An NSString object containing an integer value stating how long in seconds the cookie should be kept, at most.
ja: NSStringオブジェクト、最大でどのくらい長くクッキーが保全されるべきかを秒数で述べている整数値を含んでいます。

source: An NSString object containing comma-separated integer values specifying the ports for the cookie.
ja: NSStringオブジェクト、クッキーに対するポートを指定しているコンマ区切りの整数値を含んでいます。

source: An NSString object containing the comment for the cookie.
ja: NSStringオブジェクト、クッキーに対するコメントを含んでいます。

source: An NSString object containing the domain for the cookie.
ja: NSStringオブジェクト、クッキーに対するドメインを含んでいます。

source: An NSString object containing the name of the cookie.
ja: NSStringオブジェクト、クッキーの名前を含んでいます。

source: An NSString object containing the path for the cookie.
ja: NSStringオブジェクト、クッキーに対するパスを含んでいます。

source: An NSString object containing the path of the directory or file to which the symbolic link path refers.
ja: それに対してシンボリックリンクpathが言及するディレクトリまたはファイルのパスを含んでいるNSStringオブジェクト。

source: An NSString object containing the value of the cookie.
ja: NSStringオブジェクト、クッキーの値を含んでいます。

source: An NSString object converted from the C-string representation string with length len of a pathname in the current file system.
ja: あるNSStringオブジェクト、現在のファイルシステムでのあるパス名のlen長さを持つC文字列表現stringから変換されます。

source: An NSString object indicating that the cookie should be transmitted only over secure channels.
ja: NSStringオブジェクト、クッキーが安全な経路越しにのみ送信されるべきであることを指し示しています。

source: An NSString object stating whether the cookie should be discarded at the end of the session.
ja: NSStringオブジェクト、クッキーがセッションの終わりで廃棄されるべきかどうかを述べています。

source: An NSString object that is used for editing the textual representation of an Object.
ja: NSStringオブジェクト、それはan Objectのテキスト表現を編集するために使われます。

source: An NSString object that specifies the version of the cookie.
ja: NSStringオブジェクト、それはクッキーのバージョンを指定します。

source: An NSString object that textually represents object for display.
ja: NSStringオブジェクト、それはobjectを表示用にテキスト的に表します。

source: An NSString that provides a brief description of the error.
ja: エラーの簡潔な説明を提供するNSString。

source: An NSString that specifies the name of the application that generated the error.
ja: エラーを発生したアプリケーションの名前を指定するNSString。

source: An NSString that supplies a detailed description of the error condition.
ja: エラーの状態の詳細な説明を提供するNSString。

source: An NSString-keyed dictionary of the receiver's scriptable properties, including all of those that are declared as Attributes and ToOneRelationships in the .script Suite property list entries for the class and its scripting superclasses, with the exception of ones keyed by "scriptingProperties." Each key in the dictionary must be identical to the key for an Attribute or ToOneRelationship.
ja: レシーバの持つスクリプト対応プロパティの、NSStringでキー付けされた辞書です、含んでいるのは.script Suiteプロパティリスト登録項目においてクラスとそれのスクリプティングスーパークラスに対してAttributesおよびToOneRelationshipsとして宣言される全てのもので、「scriptingProperties」によってキー付けされるものは除きます。辞書の中の各キーはAttributeまたはToOneRelationshipに対するキーと一致しなくてはなりません。

source: An NSString-keyed dictionary of the receiver's scriptable properties.
ja: レシーバの持つスクリプト対応プロパティのNSStringでキー付けされた辞書。

source: An NSURL for the resource file or nil if the file was not found.
ja: リソースファイルに対するNSURL、またはファイルが見つけられなかったならばnil。

source: An NSURL object or NSString object containing the comment URL for the cookie.
ja: NSURLオブジェクトまたはNSStringオブジェクト、クッキーに対するコメントURLを含んでいます。

source: An NSURLConnection object lets you load the contents of a URL by providing a URL request object.
ja: NSURLConnectionオブジェクトは、あなたにURLリクエストオブジェクトを提供することによってあるURLのコンテンツをロードさせます。

source: An NSURLProtocol object handles the loading of protocol-specific URL data.
ja: NSURLProtocolオブジェクトは、プロトコル特有のURLデータのロードを取り扱います。

source: An NSValue that specifies a range.
ja: 範囲を指定するNSValue。

source: An NSDate Components object is not required to define all the component fields.
ja: NSDate Componentsオブジェクトは、すべての構成要素欄の定義を要求しません。

source: An Apple event descriptor whose data has yet to be set, or nil if an error occurs.
ja: そのデータがまた設定されていないアップルイベント記述子、またはエラーが起こるならばnil。

source: An Apple event is being handled on the current thread if current Apple Event does not return nil.
ja: current Apple Eventがnilを返さないならば、あるアップルイベントが現在のスレッド上で取り扱われています。

source: An Apple event is being handled on the current thread if a handler that was registered with set Event Handler(_: and Selector: for Event Class: and Event ID:) is being messaged at this instant or set Current Apple Event And Reply Event With Suspension ID(_:) has just been invoked.
ja: set Event Handler(_: and Selector: for Event Class: and Event ID:)で登録されたあるハンドラがこの瞬間にメッセージを送られているまたはset Current Apple Event And Reply Event With Suspension ID(_:)がちょうど発動されたところならば、あるアップルイベントが現在のスレッド上で取り扱われています。

source: An Apple event is identified by its event class and event ID, a pair of four-character codes stored as 32-bit integers.
ja: あるアップルイベントは、イベントクラスとイベントID、32bit整数として格納される４文字コードのペアによって識別されます。
